testPhase/testCase/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
 frontHeated
    {
    	type wedge;
    
    }
     backHeated
    {
    	type wedge;
    
    }
     frontCooled
    {
    	type wedge;
    
    }
     backCooled
    {
    	type wedge;
    
    }
    
    heatedWall
    {
    	type            zeroGradient;
    
    }
    
    cooledWall
    {
    	type            zeroGradient;
    }
    
    backWall
    {
    	type            zeroGradient;
    }

    atmosphere
    {
             type            inletOutlet;
             inletValue      $internalField;
    }
    
    axis
    {
	type empty;
    }

    defaultFaces
    {
        type            empty;
    }

}

// ************************************************************************* //
