testPhase/testCase/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

frontHeated
    {
    	type wedge;
    
    }
     backHeated
    {
    	type wedge;
    
    }
     frontCooled
    {
    	type wedge;
    
    }
     backCooled
    {
    	type wedge;
    
    }
    
    heatedWall
    {
    	type            noSlip;
    
    }
    
    cooledWall
    {
    	type            noSlip;
    }
    
    backWall
    {
    	type            noSlip;
    }

    atmosphere
    {
            type            pressureInletOutletVelocity;
            value           uniform (0 0 0);
    }
    
    axis
    {
	type empty;
    }

    defaultFaces
    {
        type            empty;
    }

}


// ************************************************************************* //
