testPhase/testCase/0/alpha.water
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
6000
(
0
0
0
0
0
0
0
0
...
)
;

boundaryField
{
    frontHeated
    {
        type            wedge;
    }
    backHeated
    {
        type            wedge;
    }
    frontCooled
    {
        type            wedge;
    }
    backCooled
    {
        type            wedge;
    }
    heatedWall
    {
        type            zeroGradient;
    }
    cooledWall
    {
        type            zeroGradient;
    }
    backWall
    {
        type            zeroGradient;
    }
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 0;
    }
    axis
    {
        type            empty;
    }
}


// ************************************************************************* //
