testPhase/testCase/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{

 frontHeated
    {
    	type wedge;
    
    }
     backHeated
    {
    	type wedge;
    
    }
     frontCooled
    {
    	type wedge;
    
    }
     backCooled
    {
    	type wedge;
    
    }
    
    heatedWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    	
    
    }
    
    cooledWall
    {
    	type        	nutkWallFunction;
        value           uniform 0;
    }
    
    backWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    	
    }

    atmosphere
    {
        type            calculated;
        value           uniform 0;
    }
    
    axis
    {
	type empty;
    }



    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
