testPhase/testCase/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{

	 frontHeated
    {
    	type wedge;
    
    }
     backHeated
    {
    	type wedge;
    
    }
     frontCooled
    {
    	type wedge;
    
    }
     backCooled
    {
    	type wedge;
    
    }
    
    heatedWall
    {
    	  type            fixedFluxPressure;
          value           $internalField;
    
    }
    
    cooledWall
    {
    	  type            fixedFluxPressure;
          value           $internalField;
    
    }
    
    backWall
    {
    	  type            fixedFluxPressure;
          value           $internalField;
    
    }

    atmosphere
    {
              type            totalPressure;
              p0              $internalField;
              rho             thermo:rho;
    }
    
    axis
    {
	type empty;
    }

    defaultFaces
    {
        type            empty;
    }

}

// ************************************************************************* //
